let check = `Самопроверочка....

Страница Main:

1. Проверка верстки +7
    - Верстка вылидна(отсутствуют ошибки и предупреждения) +4
    - логотип в хедере состоит из текстовых элементов +1
    - страница содержит ровно один элемент <h1> +1
    - добавлен favicon +1

2. Вёрстка соответствует макету +35
    - блок <header> +5
    - блок Not only +5
    - блок About +5
    - блок Our Friends +5
    - блок Help +5
    - блок In addition +5
    - блок <footer> +5
    
3. Требования к css +6
    - для возиционирования эл-тов в блоке help использовал flexbox +2
    - при уменьшении масштаба страницы браузера верстка центруется +2
    - фон растягивается на всю ширину экрана +2

4. Интерактивность элементов +12
    - элемент About the Shelter в навигации подсвечен и неинтерактивен, остальные элементы навигации интерактивны +2
    - каждая карточка с питомцем в блоке Our Friends интерактивна при наведении на любую область этой карточки +2
    - плавная прокрутка по якорям +2
    - выполнены все ссылочные связи +2
    - выполнена интерактивность ссылок и кнопок (цветовая палитра согдано стайлгайду макета, для плавности свойства transition) +2
    - обязательное требование к интерактивности: плавное изменение внешнего вида элемента +2

Страница Pets:

1. Проверка верстки +7
    - Верстка вылидна(отсутствуют ошибки и предупреждения) +4
    - логотип в хедере состоит из текстовых элементов +1
    - страница содержит ровно один элемент <h1> +1
    - добавлен favicon +1

2. Вёрстка соответствует макету +15
    - блок <header> +5
    - блок Our Friends +5
    - блок <footer> +5

3. Требования к css +4
    - при уменьшении масштаба страницы браузера верстка центруется +2
    - фон растягивается на всю ширину экрана +2

4. Интерактивность элементов +14
    - элемент Our pets в навигации подсвечен и неинтерактивен, остальные элементы навигации интерактивны +2
    - доступные кнопки пагинации (вправо) активны, недоступные (влево) - неактивны (disabled) +2
    - каждая карточка с питомцем в блоке Our Friends интерактивна при наведении на любую область этой карточки +2
    - плавная прокрутка по якорям +2
    - выполняются все ссылочные связи согласно перечню ссылочных связей для страницы Pets +2
    - выполнена интерактивность ссылок и кнопок (цветовая палитра согдано стайлгайду макета, для плавности свойства transition) +2
    - обязательное требование к интерактивности: плавное изменение внешнего вида элемента +2

    P.S. В целом считаю работа выполнена достойно и в целом соответствует требованиям прописанным в ТЗ. 
    Почти удалось попасть в пиксель, возможно вы где-то заметите недочеты, а может и нет. 
    Также хочу заметить, что интерактив присутствует(плавность и изменение цвета фона или шрифта), по поводу состояния ссылок при применеии псевдокласса activ, много раз писал в DS, но как говорится сколько людей столько и мнений. ПОэтому оставил как есть, хотя на active можно было добавлять бордер в элементы навигации(это сугобу мое мнение)
    Вобщем я старался.... Спасибо ))))

    TotalScore 100 / 100
`;
console.log(check);
